IOsetting/py32f0-template/Libraries/CMSIS/Device/PY32F0xx/Include/py32f072x8.h
/*!< USBD_INTRE */
#define USBD_INTRE_EN_Suspend_Pos               (0U)
#define USBD_INTRE_EN_Suspend_Msk               (0x1UL << USBD_INTRE_EN_Suspend_Pos)              /*!< 0x00000001 */
#define USBD_INTRE_EN_Suspend                   USBD_INTRE_EN_Suspend_Msk                         /*!< desc EN_Suspend */
#define USBD_INTRE_EN_Resume_Pos                (1U)
#define USBD_INTRE_EN_Resume_Msk                (0x1UL << USBD_INTRE_EN_Resume_Pos)               /*!< 0x00000002 */
#define USBD_INTRE_EN_Resume                    USBD_INTRE_EN_Resume_Msk                          /*!< desc EN_Resume */
#define USBD_INTRE_EN_Reset_Pos                 (2U)
#define USBD_INTRE_EN_Reset_Msk                 (0x1UL << USBD_INTRE_EN_Reset_Pos)                /*!< 0x00000004 */
#define USBD_INTRE_EN_Reset                     USBD_INTRE_EN_Reset_Msk                           /*!< desc EN_Reset */
#define USBD_INTRE_EN_SOF_Pos                   (3U)
#define USBD_INTRE_EN_SOF_Msk                   (0x1UL << USBD_INTRE_EN_SOF_Pos)                  /*!< 0x00000008 */
#define USBD_INTRE_EN_SOF                       USBD_INTRE_EN_SOF_Msk                             /*!< desc EN_SOF */
#define USBD_INTRE_EP1OUTE_Pos                  (9U)
#define USBD_INTRE_EP1OUTE_Msk                  (0x1UL << USBD_INTRE_EP1OUTE_Pos)                 /*!< 0x00000200 */
#define USBD_INTRE_EP1OUTE                      USBD_INTRE_EP1OUTE_Msk                            /*!< desc EP1OUTE */
#define USBD_INTRE_EP2OUTE_Pos                  (10U)
#define USBD_INTRE_EP2OUTE_Msk                  (0x1UL << USBD_INTRE_EP2OUTE_Pos)                 /*!< 0x00000400 */
#define USBD_INTRE_EP2OUTE                      USBD_INTRE_EP2OUTE_Msk                            /*!< desc EP2OUTE */
#define USBD_INTRE_EP3OUTE_Pos                  (11U)
#define USBD_INTRE_EP3OUTE_Msk                  (0x1UL << USBD_INTRE_EP3OUTE_Pos)                 /*!< 0x00000800 */
#define USBD_INTRE_EP3OUTE                      USBD_INTRE_EP3OUTE_Msk                            /*!< desc EP3OUTE */
#define USBD_INTRE_EP4OUTE_Pos                  (12U)
#define USBD_INTRE_EP4OUTE_Msk                  (0x1UL << USBD_INTRE_EP4OUTE_Pos)                 /*!< 0x00001000 */
#define USBD_INTRE_EP4OUTE                      USBD_INTRE_EP4OUTE_Msk                            /*!< desc EP4OUTE */
#define USBD_INTRE_EP5OUTE_Pos                  (13U)
#define USBD_INTRE_EP5OUTE_Msk                  (0x1UL << USBD_INTRE_EP5OUTE_Pos)                 /*!< 0x00002000 */
#define USBD_INTRE_EP5OUTE                      USBD_INTRE_EP5OUTE_Msk                            /*!< desc EP5OUTE */
#define USBD_INTRE_EP0_Pos                      (16U)
#define USBD_INTRE_EP0_Msk                      (0x1UL << USBD_INTRE_EP0_Pos)                     /*!< 0x00010000 */
#define USBD_INTRE_EP0                          USBD_INTRE_EP0_Msk                                /*!< desc EP0 */
#define USBD_INTRE_EP1INE_Pos                   (17U)
#define USBD_INTRE_EP1INE_Msk                   (0x1UL << USBD_INTRE_EP1INE_Pos)                  /*!< 0x00020000 */
#define USBD_INTRE_EP1INE                       USBD_INTRE_EP1INE_Msk                             /*!< desc EP1INE */
#define USBD_INTRE_EP2INE_Pos                   (18U)
#define USBD_INTRE_EP2INE_Msk                   (0x1UL << USBD_INTRE_EP2INE_Pos)                  /*!< 0x00040000 */
#define USBD_INTRE_EP2INE                       USBD_INTRE_EP2INE_Msk                             /*!< desc EP2INE */
#define USBD_INTRE_EP3INE_Pos                   (19U)
#define USBD_INTRE_EP3INE_Msk                   (0x1UL << USBD_INTRE_EP3INE_Pos)                  /*!< 0x00080000 */
#define USBD_INTRE_EP3INE                       USBD_INTRE_EP3INE_Msk                             /*!< desc EP3INE */
#define USBD_INTRE_EP4INE_Pos                   (20U)
#define USBD_INTRE_EP4INE_Msk                   (0x1UL << USBD_INTRE_EP4INE_Pos)                  /*!< 0x00100000 */
#define USBD_INTRE_EP4INE                       USBD_INTRE_EP4INE_Msk                             /*!< desc EP4INE */
#define USBD_INTRE_EP5INE_Pos                   (21U)
#define USBD_INTRE_EP5INE_Msk                   (0x1UL << USBD_INTRE_EP5INE_Pos)                  /*!< 0x00200000 */
#define USBD_INTRE_EP5INE                       USBD_INTRE_EP5INE_Msk                             /*!< desc EP5INE */

/*!< USBD_FRAME */
#define USBD_FRAME_FramNUM_Pos                  (0U)
#define USBD_FRAME_FramNUM_Msk                  (0x7FFUL << USBD_FRAME_FramNUM_Pos)               /*!< 0x0000007F */
#define USBD_FRAME_FramNUM                      USBD_FRAME_FramNUM_Msk                            /*!< desc FramNUM */
#define USBD_FRAME_FramNUM_0                    (0x1UL << USBD_FRAME_FramNUM_Pos)                 /*!< 0x00000001 */
#define USBD_FRAME_FramNUM_1                    (0x2UL << USBD_FRAME_FramNUM_Pos)                 /*!< 0x00000002 */
#define USBD_FRAME_FramNUM_2                    (0x4UL << USBD_FRAME_FramNUM_Pos)                 /*!< 0x00000004 */
#define USBD_FRAME_FramNUM_3                    (0x8UL << USBD_FRAME_FramNUM_Pos)                 /*!< 0x00000008 */
#define USBD_FRAME_FramNUM_4                    (0x10UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000010 */
#define USBD_FRAME_FramNUM_5                    (0x20UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000020 */
#define USBD_FRAME_FramNUM_6                    (0x40UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000040 */
#define USBD_FRAME_FramNUM_7                    (0x8UL << USBD_FRAME_FramNUM_Pos)                 /*!< 0x00000008 */
#define USBD_FRAME_FramNUM_8                    (0x10UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000010 */
#define USBD_FRAME_FramNUM_9                    (0x20UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000020 */
#define USBD_FRAME_FramNUM_10                   (0x40UL << USBD_FRAME_FramNUM_Pos)                /*!< 0x00000040 */
#define USBD_FRAME_INDEX_Pos                    (16U)
#define USBD_FRAME_INDEX_Msk                    (0xFUL << USBD_FRAME_INDEX_Pos)                   /*!< 0x000F0000 */
#define USBD_FRAME_INDEX                        USBD_FRAME_INDEX_Msk                              /*!< desc INDEX */
#define USBD_FRAME_INDEX_0                      (0x1UL << USBD_FRAME_INDEX_Pos)                   /*!< 0x00000001 */
#define USBD_FRAME_INDEX_1                      (0x2UL << USBD_FRAME_INDEX_Pos)                   /*!< 0x00000002 */
#define USBD_FRAME_INDEX_2                      (0x4UL << USBD_FRAME_INDEX_Pos)                   /*!< 0x00000004 */
#define USBD_FRAME_INDEX_3                      (0x8UL << USBD_FRAME_INDEX_Pos)                   /*!< 0x00000008 */

/*!< USBD_EP0CSR */
#define USBD_EP0CSR_OutPktRdy_Pos               (0U)
#define USBD_EP0CSR_OutPktRdy_Msk               (0x1UL << USBD_EP0CSR_OutPktRdy_Pos)              /*!< 0x00000001 */
#define USBD_EP0CSR_OutPktRdy                   USBD_EP0CSR_OutPktRdy_Msk                         /*!< desc OutPktRdy */
#define USBD_EP0CSR_InPktRdy_Pos                (1U)
#define USBD_EP0CSR_InPktRdy_Msk                (0x1UL << USBD_EP0CSR_InPktRdy_Pos)               /*!< 0x00000002 */
#define USBD_EP0CSR_InPktRdy                    USBD_EP0CSR_InPktRdy_Msk                          /*!< desc InPktRdy */
#define USBD_EP0CSR_SentStall_Pos               (2U)
#define USBD_EP0CSR_SentStall_Msk               (0x1UL << USBD_EP0CSR_SentStall_Pos)              /*!< 0x00000004 */
#define USBD_EP0CSR_SentStall                   USBD_EP0CSR_SentStall_Msk                         /*!< desc SentStall */
#define USBD_EP0CSR_DataEnd_Pos                 (3U)
#define USBD_EP0CSR_DataEnd_Msk                 (0x1UL << USBD_EP0CSR_DataEnd_Pos)                /*!< 0x00000008 */
#define USBD_EP0CSR_DataEnd                     USBD_EP0CSR_DataEnd_Msk                           /*!< desc DataEnd */
#define USBD_EP0CSR_SetupEnd_Pos                (4U)
#define USBD_EP0CSR_SetupEnd_Msk                (0x1UL << USBD_EP0CSR_SetupEnd_Pos)               /*!< 0x00000010 */
#define USBD_EP0CSR_SetupEnd                    USBD_EP0CSR_SetupEnd_Msk                          /*!< desc SetupEnd */
#define USBD_EP0CSR_SendStall_Pos               (5U)
#define USBD_EP0CSR_SendStall_Msk               (0x1UL << USBD_EP0CSR_SendStall_Pos)              /*!< 0x00000020 */
#define USBD_EP0CSR_SendStall                   USBD_EP0CSR_SendStall_Msk                         /*!< desc SendStall */
#define USBD_EP0CSR_ServicedOutPktRdy_Pos       (6U)
#define USBD_EP0CSR_ServicedOutPktRdy_Msk       (0x1UL << USBD_EP0CSR_ServicedOutPktRdy_Pos)      /*!< 0x00000040 */
#define USBD_EP0CSR_ServicedOutPktRdy           USBD_EP0CSR_ServicedOutPktRdy_Msk                 /*!< desc ServicedOutPktRdy */
#define USBD_EP0CSR_ServicedSetupEnd_Pos        (7U)
#define USBD_EP0CSR_ServicedSetupEnd_Msk        (0x1UL << USBD_EP0CSR_ServicedSetupEnd_Pos)       /*!< 0x00000080 */
#define USBD_EP0CSR_ServicedSetupEnd            USBD_EP0CSR_ServicedSetupEnd_Msk                  /*!< desc ServicedSetupEnd */
#define USBD_EP0CSR_COUNT0_Pos                  (8U)
#define USBD_EP0CSR_COUNT0_Msk                  (0x1UL << USBD_EP0CSR_COUNT0_Pos)                 /*!< 0x00007F00 */
#define USBD_EP0CSR_COUNT0                      USBD_EP0CSR_COUNT0_Msk                            /*!< desc COUNT0 */

/*!< USBD_INEPxCSR */
#define USBD_INEPxCSR_FrcDataTog_Pos            (3U)
#define USBD_INEPxCSR_FrcDataTog_Msk            (0x1UL << USBD_INEPxCSR_FrcDataTog_Pos)           /*!< 0x00000008 */
#define USBD_INEPxCSR_FrcDataTog                USBD_INEPxCSR_FrcDataTog_Msk                      /*!< desc FrcDataTog */
#define USBD_INEPxCSR_DMAEnab_Pos               (4U)
#define USBD_INEPxCSR_DMAEnab_Msk               (0x1UL << USBD_INEPxCSR_DMAEnab_Pos)              /*!< 0x00000010 */
#define USBD_INEPxCSR_DMAEnab                   USBD_INEPxCSR_DMAEnab_Msk                         /*!< desc DMAEnab */
#define USBD_INEPxCSR_Mode_Pos                  (5U)
#define USBD_INEPxCSR_Mode_Msk                  (0x1UL << USBD_INEPxCSR_Mode_Pos)                 /*!< 0x00000020 */
#define USBD_INEPxCSR_Mode                      USBD_INEPxCSR_Mode_Msk                            /*!< desc Mode */
#define USBD_INEPxCSR_ISO_Pos                   (6U)
#define USBD_INEPxCSR_ISO_Msk                   (0x1UL << USBD_INEPxCSR_ISO_Pos)                  /*!< 0x00000040 */
#define USBD_INEPxCSR_ISO                       USBD_INEPxCSR_ISO_Msk                             /*!< desc ISO */
#define USBD_INEPxCSR_AutoSet_Pos               (7U)
#define USBD_INEPxCSR_AutoSet_Msk               (0x1UL << USBD_INEPxCSR_AutoSet_Pos)              /*!< 0x00000080 */
#define USBD_INEPxCSR_AutoSet                   USBD_INEPxCSR_AutoSet_Msk                         /*!< desc AutoSet */
#define USBD_INEPxCSR_InPktRdy_Pos              (8U)
#define USBD_INEPxCSR_InPktRdy_Msk              (0x1UL << USBD_INEPxCSR_InPktRdy_Pos)             /*!< 0x00000100 */
#define USBD_INEPxCSR_InPktRdy                  USBD_INEPxCSR_InPktRdy_Msk                        /*!< desc InPktRdy */
#define USBD_INEPxCSR_FIFONotEmpty_Pos          (9U)
#define USBD_INEPxCSR_FIFONotEmpty_Msk          (0x1UL << USBD_INEPxCSR_FIFONotEmpty_Pos)         /*!< 0x00000200 */
#define USBD_INEPxCSR_FIFONotEmpty              USBD_INEPxCSR_FIFONotEmpty_Msk                    /*!< desc FIFONotEmpty */
#define USBD_INEPxCSR_UnderRun_Pos              (10U)
#define USBD_INEPxCSR_UnderRun_Msk              (0x1UL << USBD_INEPxCSR_UnderRun_Pos)             /*!< 0x00000400 */
#define USBD_INEPxCSR_UnderRun                  USBD_INEPxCSR_UnderRun_Msk                        /*!< desc UnderRun */
#define USBD_INEPxCSR_FlushFIFO_Pos             (11U)
#define USBD_INEPxCSR_FlushFIFO_Msk             (0x1UL << USBD_INEPxCSR_FlushFIFO_Pos)            /*!< 0x00000800 */
#define USBD_INEPxCSR_FlushFIFO                 USBD_INEPxCSR_FlushFIFO_Msk                       /*!< desc FlushFIFO */
#define USBD_INEPxCSR_SendStall_Pos             (12U)
#define USBD_INEPxCSR_SendStall_Msk             (0x1UL << USBD_INEPxCSR_SendStall_Pos)            /*!< 0x00001000 */
#define USBD_INEPxCSR_SendStall                 USBD_INEPxCSR_SendStall_Msk                       /*!< desc SendStall */
#define USBD_INEPxCSR_SentStall_Pos             (13U)
#define USBD_INEPxCSR_SentStall_Msk             (0x1UL << USBD_INEPxCSR_SentStall_Pos)            /*!< 0x00002000 */
#define USBD_INEPxCSR_SentStall                 USBD_INEPxCSR_SentStall_Msk                       /*!< desc SentStall */
#define USBD_INEPxCSR_ClrDataTog_Pos            (14U)
#define USBD_INEPxCSR_ClrDataTog_Msk            (0x1UL << USBD_INEPxCSR_ClrDataTog_Pos)           /*!< 0x00004000 */
#define USBD_INEPxCSR_ClrDataTog                USBD_INEPxCSR_ClrDataTog_Msk                      /*!< desc ClrDataTog */
#define USBD_INEPxCSR_INMAXP_Pos                (16U)
#define USBD_INEPxCSR_INMAXP_Msk                (0x1UL << USBD_INEPxCSR_INMAXP_Pos)               /*!< 0x00FF0000 */
#define USBD_INEPxCSR_INMAXP                    USBD_INEPxCSR_INMAXP_Msk                          /*!< desc INMAXP */

/*!< USBD_OUTEPxCSR */
#define USBD_OUTEPxCSR_DMAMode_Pos              (4U)
#define USBD_OUTEPxCSR_DMAMode_Msk              (0x1UL << USBD_OUTEPxCSR_DMAMode_Pos)             /*!< 0x00000010 */
#define USBD_OUTEPxCSR_DMAMode                  USBD_OUTEPxCSR_DMAMode_Msk                        /*!< desc DMAMode */
#define USBD_OUTEPxCSR_DMAEnab_Pos              (5U)
#define USBD_OUTEPxCSR_DMAEnab_Msk              (0x1UL << USBD_OUTEPxCSR_DMAEnab_Pos)             /*!< 0x00000020 */
#define USBD_OUTEPxCSR_DMAEnab                  USBD_OUTEPxCSR_DMAEnab_Msk                        /*!< desc DMAEnab */
#define USBD_OUTEPxCSR_ISO_Pos                  (6U)
#define USBD_OUTEPxCSR_ISO_Msk                  (0x1UL << USBD_OUTEPxCSR_ISO_Pos)                 /*!< 0x00000040 */
#define USBD_OUTEPxCSR_ISO                      USBD_OUTEPxCSR_ISO_Msk                            /*!< desc ISO */
#define USBD_OUTEPxCSR_AutoClear_Pos            (7U)
#define USBD_OUTEPxCSR_AutoClear_Msk            (0x1UL << USBD_OUTEPxCSR_AutoClear_Pos)           /*!< 0x00000080 */
#define USBD_OUTEPxCSR_AutoClear                USBD_OUTEPxCSR_AutoClear_Msk                      /*!< desc AutoClear */
#define USBD_OUTEPxCSR_OutPktRdy_Pos            (8U)
#define USBD_OUTEPxCSR_OutPktRdy_Msk            (0x1UL << USBD_OUTEPxCSR_OutPktRdy_Pos)           /*!< 0x00000100 */
#define USBD_OUTEPxCSR_OutPktRdy                USBD_OUTEPxCSR_OutPktRdy_Msk                      /*!< desc OutPktRdy */
#define USBD_OUTEPxCSR_FIFOFull_Pos             (9U)
#define USBD_OUTEPxCSR_FIFOFull_Msk             (0x1UL << USBD_OUTEPxCSR_FIFOFull_Pos)            /*!< 0x00000200 */
#define USBD_OUTEPxCSR_FIFOFull                 USBD_OUTEPxCSR_FIFOFull_Msk                       /*!< desc FIFOFull */
#define USBD_OUTEPxCSR_OverRun_Pos              (10U)
#define USBD_OUTEPxCSR_OverRun_Msk              (0x1UL << USBD_OUTEPxCSR_OverRun_Pos)             /*!< 0x00000400 */
#define USBD_OUTEPxCSR_OverRun                  USBD_OUTEPxCSR_OverRun_Msk                        /*!< desc OverRun */
#define USBD_OUTEPxCSR_DataError_Pos            (11U)
#define USBD_OUTEPxCSR_DataError_Msk            (0x1UL << USBD_OUTEPxCSR_DataError_Pos)           /*!< 0x00000800 */
#define USBD_OUTEPxCSR_DataError                USBD_OUTEPxCSR_DataError_Msk                      /*!< desc DataError */
#define USBD_OUTEPxCSR_FlushFIFO_Pos            (12U)
#define USBD_OUTEPxCSR_FlushFIFO_Msk            (0x1UL << USBD_OUTEPxCSR_FlushFIFO_Pos)           /*!< 0x00001000 */
#define USBD_OUTEPxCSR_FlushFIFO                USBD_OUTEPxCSR_FlushFIFO_Msk                      /*!< desc FlushFIFO */
#define USBD_OUTEPxCSR_SendStall_Pos            (13U)
#define USBD_OUTEPxCSR_SendStall_Msk            (0x1UL << USBD_OUTEPxCSR_SendStall_Pos)           /*!< 0x00002000 */
#define USBD_OUTEPxCSR_SendStall                USBD_OUTEPxCSR_SendStall_Msk                      /*!< desc SendStall */
#define USBD_OUTEPxCSR_SentStall_Pos            (14U)
#define USBD_OUTEPxCSR_SentStall_Msk            (0x1UL << USBD_OUTEPxCSR_SentStall_Pos)           /*!< 0x00004000 */
#define USBD_OUTEPxCSR_SentStall                USBD_OUTEPxCSR_SentStall_Msk                      /*!< desc SentStall */
#define USBD_OUTEPxCSR_ClrDataTog_Pos           (15U)
#define USBD_OUTEPxCSR_ClrDataTog_Msk           (0x1UL << USBD_OUTEPxCSR_ClrDataTog_Pos)          /*!< 0x00008000 */
#define USBD_OUTEPxCSR_ClrDataTog               USBD_OUTEPxCSR_ClrDataTog_Msk                     /*!< desc ClrDataTog */
#define USBD_OUTEPxCSR_INMAXP_Pos               (16U)
#define USBD_OUTEPxCSR_INMAXP_Msk               (0x1UL << USBD_OUTEPxCSR_INMAXP_Pos)              /*!< 0x00FF0000 */
#define USBD_OUTEPxCSR_INMAXP                   USBD_OUTEPxCSR_INMAXP_Msk                         /*!< desc INMAXP */

